                                            üåü Pandas Mastery Roadmap

üîπ What is Pandas?

Pandas is a powerful data analysis and manipulation library for Python, providing data structures like DataFrames and Series to efficiently handle structured data.

üîπ Installing Pandas

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\alamgir\appdata\local\programs\python\python312\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\alamgir\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\alamgir\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\alamgir\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\alamgir\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: six>=1.5 in c:\users\alamgir\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

2. Pandas Data Structures
   * Series
   * DataFrame

Series: A Pandas Series is a one-dimensional labeled array capable of holding any data type. Here, we created a simple numeric series.

In [9]:
import pandas as pd  # Importing the pandas library

# Creating a Pandas Series (1D labeled array)
s = pd.Series([1, 2, 3, 4, 5])  
print(s)  # Printing the Series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
#Datatype of Series
s.dtype

dtype('int64')

In [12]:
#Number of byte consumed by Series
s.nbytes

40

In [13]:
# Number of dimension
s.ndim

1

In [14]:
# Shape of series
s.shape

(5,)

In [16]:
# length of the series
print(len(s))

5

In [19]:
# Number of element in the Series
s.count()

5

In [20]:
import pandas as pd  # Importing the pandas library

# Creating a Pandas Series (1D labeled array)
s = pd.Series(['Alice', 'Bob', 'Charlie'])  
print(s)  # Printing the Series

0      Alice
1        Bob
2    Charlie
dtype: object

In [21]:
#Datatype of Series
s.dtype

dtype('O')

In [22]:
# Number of dimension
s.ndim

1

In [24]:
dict={'a1':2,'a2':4,'a3':6}
series=pd.Series(dict)
print(series)

a1    2
a2    4
a3    6
dtype: int64

In [25]:
#Return all Series element
series[:]

a1    2
a2    4
a3    6
dtype: int64

In [26]:
#print first 2 element of the Series
series[:2]

a1    2
a2    4
dtype: int64

In [28]:
# Reverse the Series element
series[::-1]

a3    6
a2    4
a1    2
dtype: int64

In [33]:
# Add the two Series
import pandas as pd  # Importing pandas

# Creating the first Series
s1 = pd.Series([1, 2, 3, 4, 5])

# Creating the second Series from a dictionary
dict_values = {'a1': 2, 'a2': 4, 'a3': 6}
series = pd.Series(dict_values)

# Concatenating the two Series
s2 = pd.concat([s1, series])

# Printing the result
print(s2)

0     1
1     2
2     3
3     4
4     5
a1    2
a2    4
a3    6
dtype: int64

Operations on Pandas Series
 * Pandas Series supports various operations, including arithmetic, statistical, and logical operations. Let's explore some common   ones:

1Ô∏è‚É£ Arithmetic Operations

In [37]:
import pandas as pd  

# Creating two Series
s1 = pd.Series([10, 20, 30, 40, 50])
s2 = pd.Series([1, 2, 3, 4, 5])

# Addition
print(s1 + s2)  # Element-wise addition
print(s1.add(s2)) # alternative addition

# Subtraction
print(s1 - s2)  # Element-wise subtraction
print(s1.sub(s2)) # alternative subtracton

0    11
1    22
2    33
3    44
4    55
dtype: int64
0    11
1    22
2    33
3    44
4    55
dtype: int64
0     9
1    18
2    27
3    36
4    45
dtype: int64
0     9
1    18
2    27
3    36
4    45
dtype: int64

In [38]:
# Multiplication
print(s1 * s2)  # Element-wise multiplication
print(s1.mul(s2)) # alternative multiplication

# Division
print(s1 / s2)  # Element-wise division
print(s1.divide(s2)) # alternative division

0     10
1     40
2     90
3    160
4    250
dtype: int64
0     10
1     40
2     90
3    160
4    250
dtype: int64
0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64
0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

2Ô∏è‚É£ Statistical Operations

In [39]:
# Creating a Series
s = pd.Series([10, 20, 30, 40, 50])

# Basic statistics
print(s.mean())   # Mean
print(s.median()) # Median
print(s.std())    # Standard deviation
print(s.min())    # Minimum value
print(s.max())    # Maximum value
print(s.sum())    # Sum of elements

30.0
30.0
15.811388300841896
10
50
150

3Ô∏è‚É£ Logical Operations

In [40]:
# Creating a Series
s = pd.Series([10, 20, 30, 40, 50])

# Comparison operators
print(s > 25)   # Greater than 25
print(s == 30)  # Equal to 30

0    False
1    False
2     True
3     True
4     True
dtype: bool
0    False
1    False
2     True
3    False
4    False
dtype: bool

4Ô∏è‚É£ Applying Functions on Series

In [41]:
# Square each element
print(s.apply(lambda x: x**2))

0     100
1     400
2     900
3    1600
4    2500
dtype: int64

5Ô∏è‚É£ Handling Missing Values

In [42]:
s = pd.Series([10, 20, None, 40, 50])  # Series with a missing value

print(s.isnull())    # Check for missing values
print(s.fillna(0))   # Replace missing values with 0

0    False
1    False
2     True
3    False
4    False
dtype: bool
0    10.0
1    20.0
2     0.0
3    40.0
4    50.0
dtype: float64

DataFrame : A DataFrame is a two-dimensional labeled data structure, similar to an Excel table or SQL table. Here, we created a DataFrame from a dictionary.

In [5]:
# Creating a dictionary with two keys: 'Name' and 'Age'
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35]}

# Converting the dictionary into a Pandas DataFrame (tabular data structure)
df = pd.DataFrame(data)  
print(df)  # Printing the DataFrame

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [43]:
# Create Dataframe using list
lang=['Java','Python','C','C++']
df=pd.DataFrame(lang)
df

        0
0    Java
1  Python
2       C
3     C++

In [44]:
# Add cloumn in the Dataframe
rating=[1,2,3,4]
df[1]=rating
df

        0  1
0    Java  1
1  Python  2
2       C  3
3     C++  4

In [46]:
# change the columns name
df.columns=['language','rating']
df

  language  rating
0     Java       1
1   Python       2
2        C       3
3      C++       4

In [61]:
# Create Dataframe from Dictionary
df1=pd.DataFrame({'ID' :[1,2,3,4],'Name' :['Alamgir','Hasib','John','Rhamin'],'CGP':[3.80,3.50,3.25,3.75]})
df1

   ID     Name   CGP
0   1  Alamgir  3.80
1   2    Hasib  3.50
2   3     John  3.25
3   4   Rhamin  3.75

In [62]:
#List Index
df1.index

RangeIndex(start=0, stop=4, step=1)

In [63]:
# List Column Names
df1.columns

Index(['ID', 'Name', 'CGP'], dtype='object')

In [64]:
# Datatype of each column
df1.dtypes

ID        int64
Name     object
CGP     float64
dtype: object

In [65]:
# Sort Dataframe by column 'CGP' in Ascending Order
df1.sort_values(by='CGP')

   ID     Name   CGP
2   3     John  3.25
1   2    Hasib  3.50
3   4   Rhamin  3.75
0   1  Alamgir  3.80

In [66]:
# Sort Dataframe by column 'CGP' in Descending order
df1.sort_values(by='CGP',ascending=False)

   ID     Name   CGP
0   1  Alamgir  3.80
3   4   Rhamin  3.75
1   2    Hasib  3.50
2   3     John  3.25

In [67]:
# Delete column
df1.drop('Name',axis=1)

   ID   CGP
0   1  3.80
1   2  3.50
2   3  3.25
3   4  3.75

In [68]:
# change the index
df1.index=[1,2,3,4]
df1

   ID     Name   CGP
1   1  Alamgir  3.80
2   2    Hasib  3.50
3   3     John  3.25
4   4   Rhamin  3.75

Data Selection

In [70]:
# Data Selection using row label
df1.loc[1]

ID            1
Name    Alamgir
CGP         3.8
Name: 1, dtype: object

In [71]:
df1.iloc[1]

ID          2
Name    Hasib
CGP       3.5
Name: 2, dtype: object

In [72]:
# Select the two row
df1.loc[1:2]

   ID     Name  CGP
1   1  Alamgir  3.8
2   2    Hasib  3.5

In [75]:
# Data selection based on condition
df1.loc[df1.CGP>=3.50]

   ID     Name   CGP
1   1  Alamgir  3.80
2   2    Hasib  3.50
4   4   Rhamin  3.75

In [79]:
# Selecting all rows & selected columns
df1.loc[:,['Name','CGP']]

      Name   CGP
1  Alamgir  3.80
2    Hasib  3.50
3     John  3.25
4   Rhamin  3.75

In [81]:
# Data selection based on condition 
df1[(df1['CGP']>3.50) & (df1['Name']=='Alamgir')]

   ID     Name  CGP
1   1  Alamgir  3.8

In [82]:
# Display all rows where CGP has value of 3.50,3.80
df1[df1['CGP'].isin([3.50,3.80])]

   ID     Name  CGP
1   1  Alamgir  3.8
2   2    Hasib  3.5

In [83]:
df2=df1

In [84]:
df2

   ID     Name   CGP
1   1  Alamgir  3.80
2   2    Hasib  3.50
3   3     John  3.25
4   4   Rhamin  3.75

SET Value

In [85]:
# set value of 3.5 for all element in column 'CGP'
df2['CGP']=3.5
df2

   ID     Name  CGP
1   1  Alamgir  3.5
2   2    Hasib  3.5
3   3     John  3.5
4   4   Rhamin  3.5

In [89]:
# set value of 3.7 for first three rows in cloumn 'CGP'
df2.at[1:3,'CGP']=3.7
df2

   ID     Name  CGP
1   1  Alamgir  3.7
2   2    Hasib  3.7
3   3     John  3.7
4   4   Rhamin  3.5

In [99]:
# first row and 3rd column
df2.iloc[0,2]=3.9
df2

   ID     Name  CGP
1   1  Alamgir  3.9
2   2    Hasib  3.7
3   3     John  3.7
4   4   Rhamin  3.5

In [109]:
# 3rd  row and 3rd column
import numpy as np
df2.iloc[2,2]=np.nan
df2

   ID     Name  CGP
1   1  Alamgir  3.9
2   2    Hasib  3.7
3   3     John  NaN
4   4   Rhamin  3.5

In [110]:
#Detect The missing value or null value
df2.isna()

      ID   Name    CGP
1  False  False  False
2  False  False  False
3  False  False   True
4  False  False  False

In [111]:
#Detect The missing value or null value
df2.isnull()

      ID   Name    CGP
1  False  False  False
2  False  False  False
3  False  False   True
4  False  False  False

In [113]:
#find the total number null value
df2.isnull().sum()

ID      0
Name    0
CGP     1
dtype: int64

In [115]:
# Fill the null value
df2=df2.fillna(3.5)
df2

   ID     Name  CGP
1   1  Alamgir  3.9
2   2    Hasib  3.7
3   3     John  3.5
4   4   Rhamin  3.5

In [116]:
# 3rd  row and 3rd column
import numpy as np
df2.iloc[2,2]=np.nan
df2

   ID     Name  CGP
1   1  Alamgir  3.9
2   2    Hasib  3.7
3   3     John  NaN
4   4   Rhamin  3.5

In [118]:
# Drop the rows with null value
df2.dropna()

   ID     Name  CGP
1   1  Alamgir  3.9
2   2    Hasib  3.7
4   4   Rhamin  3.5

In [119]:
df2

   ID     Name  CGP
1   1  Alamgir  3.9
2   2    Hasib  3.7
3   3     John  NaN
4   4   Rhamin  3.5

In [120]:
# Drop the columns with null value
df2.dropna(axis='columns')

   ID     Name
1   1  Alamgir
2   2    Hasib
3   3     John
4   4   Rhamin

In [124]:
# 3rd  row and 3rd column
import numpy as np
df2.iloc[2:2]=np.nan
df2

    ID     Name  CGP
1  1.0  Alamgir  3.9
2  2.0    Hasib  3.7
3  3.0     John  NaN
4  4.0   Rhamin  3.5

In [128]:
# drop the null value rows in columns 'Name','CGP'
df2.dropna(subset=['Name','CGP'])

    ID     Name  CGP
1  1.0  Alamgir  3.9
2  2.0    Hasib  3.7
4  4.0   Rhamin  3.5

Statistical Operations

In [132]:
# Create Dataframe from Dictionary
df1=pd.DataFrame({'ID' :[1,2,3,4],'car value' :[100,200,300,400],'CGP':[3.80,3.50,3.25,3.75]})
df1

   ID  car value   CGP
0   1        100  3.80
1   2        200  3.50
2   3        300  3.25
3   4        400  3.75

In [134]:
print(df1.mean())    # Mean of each column
print(df1.median())  # Median of each column
print(df1.mode())    # Mode of each column
print(df1.std())     # Standard deviation
print(df1.var())     # Variance
print(df1.min())     # Minimum values
print(df1.max())     # Maximum values
print(df1.sum())     # Sum of all values in each column
print(df1.count())   # Count of non-null values per column

ID             2.500
car value    250.000
CGP            3.575
dtype: float64
ID             2.500
car value    250.000
CGP            3.625
dtype: float64
   ID  car value   CGP
0   1        100  3.25
1   2        200  3.50
2   3        300  3.75
3   4        400  3.80
ID             1.290994
car value    129.099445
CGP            0.253311
dtype: float64
ID               1.666667
car value    16666.666667
CGP              0.064167
dtype: float64
ID             1.00
car value    100.00
CGP            3.25
dtype: float64
ID             4.0
car value    400.0
CGP            3.8
dtype: float64
ID             10.0
car value    1000.0
CGP            14.3
dtype: float64
ID           4
car value    4
CGP          4
dtype: int64

In [135]:
# mean,median of specific cloumn
df1['CGP'].mean()

3.575

Apply function on Dataframe

In [136]:
df1

   ID  car value   CGP
0   1        100  3.80
1   2        200  3.50
2   3        300  3.25
3   4        400  3.75

In [138]:
# sum the all value each columns
df1.apply(sum)

ID             10.0
car value    1000.0
CGP            14.3
dtype: float64

In [139]:
# print the max value for each columns
df1.apply(max)

ID             4.0
car value    400.0
CGP            3.8
dtype: float64

In [140]:
# print the min value for each columns
df1.apply(min)

ID             1.00
car value    100.00
CGP            3.25
dtype: float64

In [141]:
# using the lambda function squert all  value  dataframe
df1.apply(lambda x: x*x)

   ID  car value      CGP
0   1      10000  14.4400
1   4      40000  12.2500
2   9      90000  10.5625
3  16     160000  14.0625

Merge Dataframe

In [145]:
df1=pd.DataFrame({'ID':[1,2,3,4],'Name':["Alamgir","Hasib","Rhamim","Rhaim"]})
df1

   ID     Name
0   1  Alamgir
1   2    Hasib
2   3   Rhamim
3   4    Rhaim

In [150]:
df2=pd.DataFrame({'ID':[1,2,5,6],'score':[20,30,40,50]})
df2

   ID  score
0   1     20
1   2     30
2   5     40
3   6     50

In [151]:
# Inner Join
pd.merge(df1,df2,on='ID',how='inner')

   ID     Name  score
0   1  Alamgir     20
1   2    Hasib     30

In [152]:
#full outer join
pd.merge(df1,df2,on='ID',how='outer')

   ID     Name  score
0   1  Alamgir   20.0
1   2    Hasib   30.0
2   3   Rhamim    NaN
3   4    Rhaim    NaN
4   5      NaN   40.0
5   6      NaN   50.0

In [153]:
#full outer left join
pd.merge(df1,df2,on='ID',how='left')

   ID     Name  score
0   1  Alamgir   20.0
1   2    Hasib   30.0
2   3   Rhamim    NaN
3   4    Rhaim    NaN

Removing Duplicates

In [154]:
df = pd.DataFrame({'A': [1, 2, 2, 3], 'B': [5, 6, 6, 7]})
df.drop_duplicates(inplace=True)
print("\nData after removing duplicates:\n", df)

Data after removing duplicates:
    A  B
0  1  5
1  2  6
3  3  7

Grouping & Aggregation

In [155]:
df = pd.DataFrame({'Department': ['HR', 'IT', 'IT', 'HR'],
                   'Salary': [40000, 60000, 65000, 42000]})

grouped = df.groupby('Department')['Salary'].mean()
print("\nAverage Salary by Department:\n", grouped)

Average Salary by Department:
 Department
HR    41000.0
IT    62500.0
Name: Salary, dtype: float64

Handling Different File Formats
 * From CSV
 * From Excel
 * From JSON

In [156]:
#From CSV
df = pd.read_csv('day.csv')
print(df.head())

   Numeric  Numeric-2 Numeric-Suffix
0        1          1            1st
1        2          2            2nd
2        3          3            3rd
3        4          4            4th
4        5          5            5th

In [162]:
#From JSON
df = pd.read_json('sample3.json')
print(df.head())

                someone         slide     dark          substance  bank  \
activity     1794271337  1.917367e+09  however               tail  True
arrangement  1794271337  1.917367e+09  however  1043877955.089715  True
camera       1794271337  1.917367e+09  however             headed  True
concerned    1794271337  1.917367e+09  however              False  True
dot          1794271337  1.917367e+09  however               True  True

             pressure         music     ball  region appropriate  ...  notice  \
activity         True  2.116869e+09  problem   False        form  ...    dawn
arrangement      True  2.116869e+09  problem   False        form  ...    dawn
camera           True  2.116869e+09  problem   False        form  ...    dawn
concerned        True  2.116869e+09  problem   False        form  ...    dawn
dot              True  2.116869e+09  problem   False        form  ...    dawn

             husband anywhere    earn      directly      friendly month   lot  \
activity       False   settle  follow -1.381413e+09 -1.117826e+09  True  True
arrangement    False   settle  follow -1.381413e+09 -1.117826e+09  True  True
camera         False   settle  follow -1.381413e+09 -1.117826e+09  True  True
concerned      False   settle  follow -1.381413e+09 -1.117826e+09  True  True
dot            False   settle  follow -1.381413e+09 -1.117826e+09  True  True

              end consonant
activity     cool      easy
arrangement  cool      easy
camera       cool      easy
concerned    cool      easy
dot          cool      easy

[5 rows x 35 columns]

In [163]:
# From Excel
df = pd.read_excel('DATA.xlsx')
print(df.head())

   ID_number  SEX  AGE        BMI  height  weight  sitting time(minutes)  \
0         56    1   62  23.389598   157.2    57.8                    480
1        444    1   53  20.173253   159.0    51.0                    180
2        345    1   41  20.690495   157.0    51.0                    300
3        201    0   49  21.295295   172.0    63.0                    600
4        107    1   49  19.124108   157.6    47.5                    720

   SF8_GH  SF8_PF  SF8_RP  ...  green and yellow vegetables_adjusted_value  \
0   50.71   53.64   53.90  ...                                    0.878498
1   50.71   53.64   53.90  ...                                    1.535166
2   58.70   48.52   42.58  ...                                   -0.651227
3   50.71   53.64   53.90  ...                                    1.870888
4   50.71   48.52   48.47  ...                                    0.027010

   other vegetables_adjusted_value  mushroom_adjusted_value  \
0                         0.764237                 1.012292
1                         0.343202                -0.386429
2                        -0.968140                -1.029964
3                        -0.421294                 0.556609
4                         0.267649                 1.604133

   seaweeds_adjusted_value  sweets_adjusted_value  fruits_adjusted_value  \
0                 0.071826              -0.319104               0.879937
1                -0.829193               0.480285               0.354088
2                 0.323203              -0.637042              -0.647267
3                -1.029191              -0.262959               2.365720
4                -1.432579              -1.594402               1.478998

   grain_adjusted_value  drinking water_adjusted_value  \
0              1.078491                       0.461723
1             -0.789526                      -0.895803
2             -0.181793                       0.701055
3              0.765856                      -0.774263
4              0.047435                      -1.112091

   alcoholic drinks_adjusted_value  cluster_number
0                        -0.288009               1
1                        -0.416041               1
2                        -0.116644               1
3                        -1.036248               1
4                         0.761636               1

[5 rows x 127 columns]

 Saving Data

In [ ]:
df.to_csv('output.csv', index=False)  # Save as CSV
df.to_excel('output.xlsx', index=False)  # Save as Excel
df.to_json('output.json')  # Save as JSON